import sys
input = sys.stdin.readline

shapes = [([1, 0], [2, 0], [3, 0]),         # 세로 1자
          ([0, 1], [0, 2], [0, 3]),         # 가로 1자
          ([1, 0], [0, 1], [1, 1]),         # 네모
          ([0, 1], [1, 1], [1, 2]),         # 4 O
          ([0, 1], [-1, 1], [-1, 2]),       # 5 O
          ([1, 0], [1, 1], [2, 1]),         # 6 O
          ([1, 0], [1, -1], [2, -1]),       # 7 O
          ([0, 1], [1, 0], [2, 0]),         # 8 O
          ([0, 1], [1, 1], [2, 1]),         # 9 O
          ([1, 0], [2, 0], [2, 1]),         # 10 O
          ([1, 0], [2, 0], [2, -1]),        # 11 O
          ([0, 1], [0, 2], [-1, 2]),
          ([0, 1], [0, 2], [1, 2]),
          ([1, 0], [1, 1], [1, 2]),
          ([-1, 0], [-1, 1], [-1, 2]),
          ([1, 0], [2, 0], [1, 1]),
          ([1, 0], [2, 0], [1, -1]),
          ([0, 1], [0, 2], [-1, 1]),
          ([0, 1], [0, 2], [1, 1])]


N, M = map(int, input().split())
arr = [list(map(int, input().split())) for _ in range(N)]
res = 0

for i in range(N):
    for j in range(M):
        for shape in shapes:
            cnt = arr[i][j]
            for s in shape:
                r, c = i+s[0], j+s[1]
                if 0 <= r < N and 0 <= c < M:
                    cnt += arr[r][c]
                else:
                    break
            else:
                res = max(res, cnt)

print(res)